import json
import re
import subprocess


with open("./dict_mini.json", encoding="utf-8") as f:
    d = json.load(f)

ids = {}
with open("./ids.txt", encoding="utf-8") as f:
    for line in f.readlines():
        _, z, *parts_ = line.strip().split("\t")
        parts = []
        for p in parts_:
            if m := re.search(r"\[(.*?)\]", p):
                if "T" not in m.group(1):
                    continue
            cleaned = re.sub(r"[⿰⿱⿲⿳⿴⿵⿶⿷⿸⿹⿺⿻\[\]A-Z\n]", "", p)
            parts.append(cleaned)
        # 3x = 2x
        if len(parts) == 3 and parts[0] == parts[1] == parts[2]:
            parts = parts[:2]
        if strike := d.get(z):
            ids[z] = [strike, parts]

patch = {
    "一": (1, ["一"]),
    "丨": (1, ["丨"]),
    "人": (2, ["丿乀"]),
    "十": (2, ["一丨"]),
    "九": (2, ["丿乙"]),
    "又": (2, ["人一"]),
    "卜": (2, ["丨丶"]),
    "匕": (2, ["匕"]),
    "凵": (2, ["凵"]),
    "㔾": (2, ["乙乙"]),
    "了": (2, ["乙乙"]),
    "厶": (2, ["乙一"]),
    "艹": (3, ["一二", "十十"]),
    "子": (3, ["了一"]),
    "工": (3, ["二丨"]),
    "也": (3, ["㔾丨"]),
    "巾": (3, ["凵丨"]),
    "广": (3, ["广"]),
    "口": (3, ["凵一"]),
    "寸": (3, ["十丶"]),
    "久": (3, ["刀丿"]),
    "才": (3, ["十丿"]),
    "彳": (3, ["人丿"]),
    "幺": (3, ["乙厶"]),
    "宀": (3, ["凵丨"]),
    "廴": (3, ["了丿"]),
    "尸": (3, ["丿凵"]),
    "木": (4, ["十人"]),
    "丰": (4, ["三丨", "一艹"]),
    "廿": (4, ["一凵"]),
    "王": (4, ["一工", "二十", "三丨"]),
    "日": (4, ["一口", "二三"]),
    "犬": (4, ["大丶"]),
    "牙": (4, ["牙"]),
    "爪": (4, ["三丿"]),
    "及": (4, ["刀又"]),
    "巨": (4, ["凵凵"]),
    "斗": (4, ["十冫"]),
    "山": (4, ["三一"]),
    "牛": (4, ["干丿"]),
    "比": (4, ["匕匕"]),
    "巴": (4, ["巳丨"]),
    "欠": (4, ["刀人"]),
    "辶": (4, ["廴丶"]),
    "出": (5, ["山山"]),
    "乍": (5, ["丿王"]),
    "目": (5, ["日一", "口二"]),
    "戊": (5, ["丿戈"]),
    "申": (5, ["日丨", "十口"]),
    "本": (5, ["木一"]),
    "瓜": (5, ["爪人"]),
    "示": (5, ["二小"]),
    "生": (5, ["牛一"]),
    "世": (5, ["凵凵"]),
    "民": (5, ["氏口"]),
    "永": (5, ["水丶"]),
    "史": (5, ["人口"]),
    "白": (5, ["丿日"]),
    "冉": (5, ["工土"]),
    "臣": (5, ["工口"]),
    "未": (5, ["木一"]),
    "疒": (5, ["疒冫"]),
    "田": (5, ["日丨", "口十", "日一"]),
    "曲": (6, ["二日", "十田", "艹口"]),
    "米": (6, ["木人"]),
    "自": (6, ["目丿"]),
    "朱": (6, ["牛人"]),
    "兆": (6, ["水儿"]),
    "州": (6, ["三川"]),
    "年": (6, ["牛𠃊"]),
    "肉": (6, ["人內"]),
    "曳": (6, ["戈口"]),
    "糸": (6, ["小幺"]),
    "虫": (6, ["口厶"]),
    "羊": (6, ["䒑艹"]),
    "身": (7, ["身"]),
    "車": (7, ["二申", "艹田"]),
    "酉": (7, ["兀日"]),
    "里": (7, ["日土", "日王", "田干"]),
    "我": (7, ["丿找"]),
    "角": (7, ["刀用"]),
    "束": (7, ["口木"]),
    "谷": (7, ["介口"]),
    "承": (8, ["永三"]),
    "非": (8, ["王王"]),
    "東": (8, ["日木"]),
    "隹": (8, ["人圭"]),
    "直": (8, ["十目"]),
    "頁": (9, ["十貝"]),
    "重": (9, ["千里"]),
}

for k, (s, v) in patch.items():
    stoke, parts = ids.get(k, [s, []])
    parts = list(
        set("".join(sorted(p)) for p in parts) | set("".join(sorted(p)) for p in v)
    )
    ids[k] = [stoke, parts]

# ids.pop("凹")
# ids.pop("凸")
# ids.pop("牙")

replacements = {
    "丿": "乀",
    "一": "丶丨",
    "人": "入八亻乂儿",
    "未": "末",
    "目": "皿且罒",
    "田": "甲由申",
    "已": "己巳",
    "日": "曰甘",
    "牛": "午井",
    "干": "土士",
    "凵": "コ冖凵匸冂",
    "二": "冫⺀",
    "三": "巛彡氵川",
    "介": "兀尢㓁䒑",
    "史": "央尺",
    "大": "丈",
    "水": "氺",
    "心": "忄灬",
    "片": "爿",
    "刀": "𠂊刂",
    "足": "𧾷",
    "手": "扌",
    "食": "飠",
    "糸": "糹",
    "衣": "衤",
    "文": "攵夊",
    "犬": "犭",
    "爪": "爫",
    "木": "朩",
    "示": "礻",
    "㔾": "卩",
    "丑": "丘",
    "月": "丹肉⺼",
    "毋": "母",
    "卜": "亠",
    "口": "囗",
    "耳": "阝",
    "乙": "乚𠃊乛亅𠃍㇇",
    "羊": "𦍌",
    "王": "壬",
}

output = "../bulid/dictionary.json"
with open(output, mode="w", encoding="utf-8") as f:
    for k, v in replacements.items():
        for ch in v:
            ids.pop(ch, None)

    t = json.dumps(ids, ensure_ascii=False)
    t = t.replace(" ", "")
    for k, v in replacements.items():
        for ch in v:
            ids.pop(ch, None)
            t = t.replace(ch, k)
    f.write(t)


# pip install fonttools
font_name = "SourceHanSerifTC-Heavy"
subprocess.run(
    [
        "pyftsubset",
        f"{font_name}.otf",
        f"--text-file={output}",
        f"--output-file=../bulid/{font_name}-Subset.otf",
    ],
    check=True,
)
